Repository: AlimanDev/mindandmachine
Catalog: data/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Automatic worker select timegap
ru: Только автоназначение сотрудников

source: Automatic worker select timegap to
ru: Период за который делаем обмен сменами

source: Automatic worker select overflow min
ru: Дробное число, на какую долю сотрудник не занят, чтобы совершить обмен

source: Working shift min hours
ru: Минимальная длина смены

source: Working shift max hours
ru: Максимальная длина смены

source: Automatic worker select tree level
ru: Расстояние до родителя, в поддереве которого ищем сотрудников для автоназначения

source: Outsourcing companies
ru: Аутсорс компании

source: Outsourcing companies that will be able to respond to an automatically created vacancy
ru: Аутсорс компании, которым можно будет откликаться на автоматически созданную вакансию

source: Plan
ru: План

source: Create
ru: Создание

source: Change
ru: Изменение

source: Remove
ru: Удаление

source: Approve
ru: Подтверждение

source: My shops employees
ru: Сотрудники моих магазинов

source: Subordinate employees
ru: Подчиненные сотрудники

source: Outsource network employees
ru: Сотрудники аутсорс сетей

source: My network employees
ru: Сотрудники сетей-клиентов

source: My shops
ru: Мои магазины

source: My network shops
ru: Магазины моей сети

source: Outsource network shops
ru: Магазины аутсорс сетей

source: Client network shops
ru: Магазине сетей-клиентов

source: Allow actions on vacancies
ru: Разрешены действия над вакансиями

source: Вакансией в данном случае является день, если он был явно создан как вакансия, либо если магазин в трудоустройстве не совпадает с магазином выхода (актуально для рабочий типов дней)
ru: The vacancy in this case is a day if it was explicitly created as vacancy, or if the store in the job placement does not match the work store (relevant for working types of days)

source: Employment can have only one main type of work.
ru: У трудойстройства может быть только один основной тип работ.

source: The start date must be the first day of the month.
ru: Дата начала должна быть равна первомю дню месяца.

source: The end date must be the last day of the month.
ru: Дата окончания должна быть равна последнему дню месяца.

source: Recalculation can only be run for 1 month.
ru: Пересчет можно запускать только для 1 месяца.

source: No shop found.
ru: Магазин не найден.

source: No employees satisfying the conditions.
ru: Не найдено сотрудников удовлетворяющих условиям запроса.

source: Timesheet recalculation started successfully.
ru: Пересчет табеля успешно запущен.

source: There is no such vacancy
ru: Такой вакансии не существует

source: The data for the exchange of shifts is not entered. Contact the director.
ru: Данные для биржи смен не внесены. Обратитесь к директору.

source: You cannot enter this vacancy.
ru: Вы не можете выйти на эту смену.

source: You can't apply for this vacancy because you don't have an active employment as of the date of the vacancy.
ru: Вы не можете выйти на эту смену, так как у вас нет активного трудоустройства на дату смены.

source: You can not enter this vacancy because this vacancy is located in another network and does not imply the possibility of outsourcing.
ru: Вы не можете выйти на эту смену, так как данная вакансия находится в другой сети и не подразумевает возможность аутсорсинга.

source: You cannot apply for this vacancy because this vacancy is located on another network and your network is not allowed to respond to this vacancy.
ru: Вы не можете выйти на эту вакансию так как данная вакансия находится в другой сети и вашей сети не разрешено откликаться на данную вакансию.

source: You cannot apply for this vacancy because your network does not allow you to apply for an outsourced vacancy in your network.
ru: Вы не можете откликнуться на данную вакансию, так как в вашей сети запрещено откликаться на аутсорс вакансии вашей сети.

source: The timetable for this period has not yet been created.
ru: График на этот период еще не составлен.

source: The vacancy was successfully accepted.
ru: Вакансия успешно принята.

source: You can't reassign an employee to this vacancy, because the employee has already entered this vacancy.
ru: Вы не можете переназначить сотрудника на данную вакансию, так как сотрудник уже вышел на данную вакансию.

source: Vacancy successfully refused.
ru: Вакансия успешно отозвана.

source: You can't refuse vacancy, because the employee has already entered this vacancy.
ru: Вы не можете отозвать вакансию, так как сотрудник уже вышел на данную вакансию.

source: bad work_type_ids
ru: некорректное значение work_type_ids

source: Worker day already exist.
ru: У сотрудника уже существует рабочий день.

source: Worker day intercepts with another: {shop_name}, {work_start}, {work_end}.
ru: Рабочий день пересекается с другим рабочим днем: {shop_name}, {work_start} - {work_end}

source: Shop in work type and in work day must match.
ru: Магазин в типе работ и в рабочем дне должен совпадать.

source: User in employment and in worker day must match.
ru: Сотрудник в трудоустройстве и в рабочем дне должны совпадать.

source: Only vacancy can be outsource.
ru: Только вакансия может быть аутсорс.

source: Outsources does not specified for outsource vacancy.
ru: Не переданы аутсорс сети, которые могут откликнуться на аутсорс вакансию.

source: There is no such shop in your network.
ru: В вашей сети нет такого магазина.

source: For the fact not approved version, you can only set {}
ru: Для неподтверждённой фактической версии вы можете установить только {}

source: Invalid pk "{pk_value}" - object does not exist.
ru: Недопустимый первичный ключ "{pk_value}" - объект не существует.

source: Start of first period can't be greater than start of second period
ru: Начало периода с которого копируются дни не может быть больше начала периода куда копируются дни.

source: The shop with the code '{}' was not found
ru: Подразделение с кодом '{}' не найдено

source: User '{}' not found
ru: Пользователь '{}' не найден

source: Shop or employees should be defined.
ru: Для получения отчета нужно передать магазин или сотрудников.

source: Employee {employee} is not your subordinate.
ru: Сотрудник {employee} не является Вашим подчиненным.

source: There is no such user in your network.
ru: В вашей сети нет такого пользователя.

source: There are no active work types in this shop.
ru: В данном магазине нет активных типов работ

source: The employee with number {} does not exist in the current shop.
ru: Сотрудник с табельным номером {} не существует в текущем магазине.

source: The employee with the full name {} does not exist in the current shop.
ru: Сотрудник с ФИО {} не существует в текущем магазине.

source: tabel code
ru: номер

source: full name
ru: ФИО

source: position
ru: должность

source: The employee's {} are not recognized or specified on the line {}.
ru: У сотрудника не распознаны или не указаны {} на строке {}.

source: There is no such position {position}.
ru: Нет такой должности {position}.

source: The employee on the line {} with the table number {} has the last name {} in the system, but in the file {}.
ru: У сотрудника на строке {} с табельным номером {} в системе фамилия {}, а в файле {}.

source: The employee {user.first_name} {user.last_name} in the cell for {dt} has the wrong value: {value}.
ru: У сотрудника {user.first_name} {user.last_name} в ячейке за {dt} неправильное значение: {value}.

source: Timetable for signature.
ru: Расписание на подпись.

source: Timetable_for_shop_{}_from_{}.xlsx
ru: Расписание_для_подразделения_{}_от_{}.xlsx

source: Position
ru: Должность

source: Timetable
ru: Расписание

source: Date
ru: Дата

source: Shift start
ru: Начало смены

source: Shift end
ru: Окончание смены

source: Can not parse date value {} on row {}.
ru: Дата {} на строке {} указана в неверном формате.

source: The employee {user.first_name} {user.last_name} in the row {i} has the wrong value: {value}.
ru: У сотрудника {user.first_name} {user.last_name} в строке {i} неправильное значение: {value}.

source: It is not possible to create days on the selected dates. Please check whether the employee has active employment.
ru: Невозможно создать дни в выбранные даты. Пожалуйста, проверьте наличие активного трудоустройства у сотрудника.

source: Worker days mismatch.
ru: Рабочие дни сотрудников не совпадают.

source: Workers don't have timetable.
ru: Отсутствует расписание у сотрудников.

source: Cannot_delete approved version.
ru: Нельзя удалить подтвержденную версию.

source: Not approved version already exists.
ru: У расписания уже есть неподтвержденная версия.

source: You do not have rights to {action_str} the day type "{wd_type_str}"
ru: У вас нет прав на {action_str} типа дня "{wd_type_str}"

source: You do not have the rights to {action_str} the type of day "{wd_type_str}" on the selected dates. You need to change the dates. Allowed interval: {dt_interval}
ru: У вас нет прав на {action_str} типа дня "{wd_type_str}" в выбранные даты. Необходимо изменить даты. Разрешенный интервал: {dt_interval}

source: You do not have rights to approve protected worker days ({protected_wdays}). Please contact your system administrator.
ru: У вас нет прав на подтверждение защищенных рабочих дней ({protected_wdays}). Обратитесь, пожалуйста, к администратору системы.

source: This vacancy does not exist or has already been approved.
ru: Такой вакансии не существует или она уже подтверждена.

source: You can not approve vacancy from other network.
ru: Вы не можете подтвердить вакансию из другой сети.

source: There is no such vacancy.
ru: Такой вакансии не существует

source: The vacancy cannot be edited because it has already been responded.
ru: Невозможно отредактировать вакансию, так как на неё уже откликнулись.

source: {}_timesheet_for_shop_{}_from_{}.{}
ru: {}_табель_для_подразделения_{}_от_{}.{}

source: Hours recalculation started successfully.
ru: Пересчет часов успешно запущен.

source: Employee work timetable for
ru: График работы сотрудников на

source: signature
ru: подпись

source: transcript
ru: расшифровка

source: Created by:
ru: Составил:

source: full name
ru: ФИО

source: POSITION
ru: ДОЛЖНОСТЬ

source: From
ru: С

source: To
ru: По

source: Days
ru: Дни

source: Hours
ru: Часы

source: the rate of hours per month
ru: норма часов на месяц

source: overtime
ru: переработка

source: date
ru: дата

source: I have read the work schedule.
ru: С графиком работы ознакомлен.

source: H
ru: В

source: V
ru: ОТ

source: On print
ru: На печать

source: Sun
ru: Вс

source: Mon
ru: Пн

source: Tue
ru: Вт

source: Wed
ru: Ср

source: Thu
ru: Чт

source: Fri
ru: Пт

source: Sat
ru: Сб

source: Descriptions
ru: Обозначения

source: Abbreviation
ru: Сокращение

source: Description
ru: Обозначение

source: Color of day of week
ru: Цвет дня недели

source: for employee
ru: для сотрудника

source: in department
ru: в подразделении

source: January
ru: Январь

source: February
ru: Февраль

source: March
ru: Март

source: April
ru: Апрель

source: May
ru: Май

source: June
ru: Июнь

source: July
ru: Июль

source: August
ru: Август

source: September
ru: Сентябрь

source: October
ru: Октябрь

source: November
ru: Ноябрь

source: December
ru: Декабрь

source: Employee
ru: ФИО сотрудника

source: Tick point
ru: Точка отметки

source: Shop
ru: Отделение

source: Shop code
ru: Код отделения

source: Tick type
ru: Тип отметки

source: Verified score
ru: Верификация

source: Liveness
ru: Качество фото

source: Photo
ru: Фото

source: Tabel for {} {}y
ru: Табель учета рабочего времени за {} {}г

source: Number in order
ru: Номер по порядку

source: Last name, initials, position (specialty, profession)
ru: Фамилия, инициалы, должность (специальность, профессия)

source: Notes on attendance and non-attendance at work on the dates of the month
ru: Отметки о явках и неявках на работу по числам месяца

source: Worked out for
ru: Отработано за

source: half of the month (I, II)
ru: половину месяца (I, II)

source: month
ru: месяц

source: Total hours
ru: Итого часы

source: Total days
ru: Итого дни

source: Shop name
ru: Наименование ОП

source: Fact, h
ru: Факт, ч

source: Plan, h
ru: План, ч

source: Shift start time, fact, h
ru: Время начала смены, факт, ч

source: Shift end time, fact, h
ru: Время окончания смены, факт, ч

source: Shift start time, plan, h
ru: Время начала смены, план, ч

source: Shift end time, plan, h
ru: Время окончания смены, план, ч

source: Not implemented.
ru: Не реализовано.

source: Your employee monitoring report is ready to be downloaded. You can access it by the following link: {} Warning: the link will expire at the end of the business day. Please use employee monitoring generation form in the application to create a new version.
ru: Ваш отчёт по отметкам сотрудников готов к загрузке. Вы можете скачать его по ссылке: {} Внимание: ссылка станет недействительной по окончанию рабочего дня. В случае необходимости воспользуйтесь формой для создания нового отчёта.

source: No files were transferred.
ru: Не было передано ни одного файла.

source: The file was not uploaded.
ru: Файл не был загружен.
