Repository: AlimanDev/mindandmachine
Catalog: data/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Basic settings
ru: Базовые настройки

source: Time attendance settings
ru: Настройки УРВ

source: Time tracking settings
ru: Настройки суммированного учета рабочего времени

source: Vacancy settings
ru: Настройки биржи смен

source: Format settings
ru: Настройки форматов

source: Timetable settings
ru: Настройки графика

source: Integration settings
ru: Настройки интеграции

source: Default settings
ru: Настройки по умолчанию

source: Other
ru: Прочее

source: Compress images
ru: Сжать изображения

source: Images compression has started
ru: Сжатие изображений запущено

source: Personal info
ru: Персональные данные

source: Permissions
ru: Доступы

source: Important dates
ru: Важные даты

source: %(name)s object with primary key %(key)r does not exist.
ru: %(name)s объект с ключом %(key)r не существует.

source: Add %s
ru: Добавить %s

source: Change %s
ru: Измененить %s

source: View %s
ru: Посмотреть %s

source: There is no such user
ru: Нет такого пользователя

source: Unable to log in with provided credentials.
ru: Невозможно войти с предоставленными учетными данными.

source: Month
ru: Месяц

source: Quarter
ru: Квартал

source: Half a year
ru: Пол года

source: Year
ru: Год

source: Cells
ru: Ячейки

source: Rows
ru: Строки

source: Name
ru: Название

source: Code
ru: Код

source: Logo
ru: Лого

source: Primary color
ru: Основной цвет

source: Secondary color
ru: Вторичный цвет

source: Settings values
ru: Значения настроек

source: Accounting period length
ru: Длина учетного периода

source: Upload employments from excel
ru: Добавлять сотрудников из Excel

source: Allowed geo distance (km)
ru: Разрешенная дистанция до магазина при создании отметок (км)

source: Allowed interval for early departure
ru: Допустимый интервал для раннего ухода

source: Allowed interval for late_arrival
ru: Допустимый интервал для опоздания

source: Allow workers confirm outsource vacancy
ru: Разрешать работникам сети откликаться на аутсорс вакансии

source: Include biometry (photos) in tick report
ru: Включать биометрию (фото) в отчёт по отметкам сотрудников

source: Default breaks
ru: Перерывы по умолчанию

source: Consider remaining hours in previous months when calculating norm hours
ru: Учитывать неотработанные часы за предыдущие месяца при расчете нормы часов

source: Convert tabel to
ru: Конвертировать табель в

source: Copy plan to fact crossing
ru: Копировать план в факт без перезаписи факта

source: Clean worker days on employment date change
ru: Запускать скрипт очистки дней при изменении дат трудойстройства

source: Create employment on set or update director code
ru: Создавать скрытое трудоустройство при проставлении/изменении director_code в подразделении

source: Crop work hours by shop schedule
ru: Обрезать рабочие часы по времени работы магазина

source: Descrease employment date fired in api
ru: Уменьшать дату окончания трудоустройства

source: Relevant for data received via the api
ru: Актуально для данных, получаемых через api

source: Ability to disconnect to an account in the charts of other stores
ru: Возможность отключить отображение сотрудника в графиках других магазинов

source: Download tabel template
ru: Шаблон для табеля

source: Enable camera ticks
ru: Включить отметки по камере в мобильной версии

source: Default exchange settings
ru: Настройки биржи смен по умолчанию

source: Fines settings
ru: Настройки штрафов

source: Ignore parent code when updating department via api
ru: Не учитывать parent_code при изменении подразделения через api

source: It must be enabled for cases when the organizational structure is maintained manually
ru: Необходимо включить для случаев, когда оргструктура поддерживается вручную

source: Default load template
ru: Шаблон нагрузки по умолчанию

source: Max difference between the start or end time to "pull" to the planned work day
ru: Максимальная разность между временем начала или окончания для "притягивания" к рабочему дню

source: Maximum shift length (in seconds)
ru: Максимальная длительность смены (в секундах)

source: Need symbol for vacancy
ru: Нужен ли идентификатор сотруднка чтобы откликнуться на вакансию

source: OKPO code
ru: Код по ОКПО

source: Count only fact hours that in approved plan
ru: Считать только те фактические часы, которые есть в подтвержденном плановом графике

source: Shop default values
ru: Параметры магазина по умолчанию

source: Show checkbox for downloading inspection version of timetable
ru: Показать настройку для выгрузки инспекционной версии расписания

source: Show closed shops in shop tree for N days
ru: Показывать закрытые магазины в дереве магазинов в течении N дней

source: Show user biometrics block
ru: Отображать блок биометрии в деталях сотрудника

source: Show worker day additional info
ru: Отображать доп. информацию в подтвержденных факте и плане

source: Displaying information about who last edited a worker day and when, when hovering over the corner
ru: Отображение при наведении на уголок информации о том, кто и когда последний раз редактировал рабочий день

source: Show worker day tasks
ru: Отображать задачи в доп. информацию по рабочему дню

source: Skip the creation of a departure mark if more than the Maximum shift length has passed since the opening of the previous shift
ru: Пропускать создание отметки об уходе, если с момента открытия предыдущей смены прошло больше, чем максимальная длительность смены.

source: Timetable format
ru: Формат загрузки/выгрузки расписания

source: Create attendance record without check photo.
ru: Создавать отметки без проверки биометрии.

source: Use internal exchange
ru: Использовать внутреннюю биржу

source: Regulates the action on the vacancy due to the exchange or natural
ru: Регулирует действие на вакансию за счет биржу или естественной

source: Worker position default values
ru: Параметры должностей по умолчанию

source: timesheet_min_hours_threshold can take either a numerical value or a function name
ru: timesheet_min_hours_threshold может принимать только числовое значение или название функции

source: It is necessary to fill in analytics_iframe in the settings values
ru: Необходимо заполнить analytics_iframe в настройках

source: Bad break triplet format {triplet}, should be [[int, int, [int, int,]],].
ru: Некорректный формат перерыва {triplet}, должно быть [[int, int, [int, int,]],].

source: First value of period can not be greater then second value: {triplet}
ru: Первое значение периода не может быть больше второго значения: {triplet}

source: Value of break can not be greater than value of period: {triplet}
ru: Значение перерыва не может быть больше значения периода: {triplet}

source: Shop with parent_code={code} not found
ru: Подразделение с parent_code={code} не найдено

source: Forecast step can't be 0.
ru: Шаг прогноза не может быть 0.

source: Keys of open times and close times are different.
ru: Ключи в времени открытия и времени закрытия различаются.

source: 'All' and individual days cannot be specified.
ru: Нельзя указывать all и отдельные дни.

source: It is not possible to change the load template as it is in the calculation process.
ru: Невозможно изменить шаблон нагрузки, так как он находится в процессе расчета.

source: There is not load template with code {}.
ru: Шаблон нагрузки с кодом {} не найден.

source: Display in the chart of my shop
ru: Отображать в графике моего магазина

source: Display in the chart of other shops
ru: Отображать в графике других магазинов

source: Unable to define worker access group. Assign an access group to him or a position associated with an access group.
ru: Невозможно определить группу доступа работника. Назначьте ему группу доступа либо должность, связанную с группой доступа.

source: Opens and closes fields are required for workday type
ru: Время открытия и закрытия обязательно для рабочего типа дня

source: Work hours should be sum of day hours and night hours
ru: Рабочие часы должны равняться сумме дневных и ночных часов

source: Not found worker day with id={wd_id}
ru: Не найден рабочей день с id={wd_id}

source: shop_id should be defined
ru: Произошла ошибка. Попробуйте перезагрузить страницу.

source: Invalid time period.
ru: Неправильный временной период.

source: ldap_login should be specified for ldap auth_type.
ru: ldap_login должен быть указан для типа авторизации ldap.

source: The employee's tabel code must be unique
ru: Табельный номер сотрудника должен быть уникален.

source: Passwords are mismatched.
ru: Пароли не совпадают.

source: Password is wrong.
ru: Неверный пароль.

source: Employment from {dt_hired} to {dt_fired} already exists.
ru: В этом магазине уже заведено трудоустройство с {dt_hired} по {dt_fired}.

source: There is {amount} models of user with username: {username}.
ru: Существует {amount} моделей пользователя с именем пользователя: {username}.

source: There is {amount} models of user with user_id: {user_id}.
ru: Существует {amount} моделей пользователя с user_id: {user_id}.

source: There is {amount} models of shop with code: {code}.
ru: Есть {amount} магазинов с кодом: {code}.

source: There is {amount} models of position with code: {code}.
ru: Есть {amount} должностей с кодом: {code}.

source: You are not allowed to choose shops from other network.
ru: Вы не можете выбирать магазины из другой сети.

source: Network of shop and position should be equal.
ru: Сети магазина и должности должны совпадать.

source: There are {amount} models of employee with tabel_code: {tabel_code}.
ru: Есть {amount} сотрудников с табельный номером: {tabel_code}.

source: There are {amount} models of shift_schedule with code: {code}.
ru: Есть {amount} графиков работы с кодом: {code}.

source: Invalid time format. Format should be {format}
ru: Неверный формат времени. Должен быть {format}

source: Invalid key value {key}. Allowed values: {possible_keys}.
ru: Недопустимое значение ключа {key}. Допустимые значения: {possible_keys}.

source: Invalid time format {time} for value {key}. The format must be {format}.
ru: Неправильный формат времени {time} для значения {key}. Формат должен быть {format}.

source: Biometrics template added successfully.
ru: Шаблон биометрии успешно добавлен.

source: The employee has biometrics. To add a new biometrics template, you need to delete the current template.
ru: Биометрия уже создана. Для создания новой биометрии сначала удалите нынешнюю.

source: csv delimiter
ru: Разделитель csv

source: For the '{}' strategy, you must select a period.
ru: Для стратегии '{}' обязательно выбрать период.

source: Apply load templates to shops
ru: Применить шаблоны нагрузки к магазинам

source: Applying load templates started
ru: Применение шаблонов нагрузки запущено

source: These operation types do not exist: {types}.
ru: Данные типы операций не существуют: {types}.

source: These operation types listed in dependencies, but not listed in operation types: {types}.
ru: Данные типы операций есть в зависимостях, но отсутствуют в списке операций: {types}.

source: Error in row {}.
ru: Ошибка в строке {}.

source: Timestep is required.
ru: Шаг прогноза обязателен.

source: Timestep {timestep} is not valid choice, choices are {timesteps}.
ru: Шаг прогноза {timestep} не является валидным, следует выбрать из {timesteps}.

source: Invalid days of week '{}', should be comma separated int in interfval from 0 to 6.
ru: Некорректное значение дней недели '{}', должны быть целочисленные значения от 0 до 6, разделенные запятой.

source: Cannot delete template as it's used in demand calculations.
ru: Данный шаблон невозможно удалить, так как используется в расчете нагрузки

source: This field ins required
ru: Это поле обязательно.

source: Not specified
ru: Не указано

source: Week
ru: Неделя

source: Day
ru: День

source: duplicate over
ru: дублировать с шагом

source: Period, that time series values need to be duplicated over. Signifies, that values should be treated as constant for this period.
ru: Период, на который должны быть продублированы значения временного ряда. Указывает, что значения следует понимать как постоянные в этом периоде.

source: max value
ru: максимальное значение

source: threshold
ru: порог

source: days of week
ru: дни недели

source: Formula required in relation {} -> {}
ru: Формула обязательна в отношении {} -> {}

source: For relation 'change workload between' {} are required.
ru: Для отношения 'перекидывание нагрузки между типами работ' {} обязательны.

source: Forecast type {} cannot be depended from {} with formula type.
ru: Прогнозируемый тип {} не может зависеть от {} с типом расчета по формуле.

source: Operation type {} cannot be depended from work type {}.
ru: Тип операции {} не может зависеть от типа работ {}.

source: Only forecast types can depend from feature serie.
ru: Только прогнозируемые типы операций могут зависеть от операций для помощи в прогнозе.

source: Feature serie {} cannot have dependences.
ru: Тип операции для помощи в прогнозе {} не может иметь зависимостей.

source: Demand model cannot depend on itself.
ru: Циклическая зависимость: операция зависит сама от себя.

source: Backward dependency already exists.
ru: Уже существует обратная зависимость

source: Base and depended demand models cannot be the same.
ru: Базовая и зависимая модели нагрузки не могут совпадать.

source: Base and depended demand models cannot have different templates.
ru: Базовая и зависимая модели не могут иметь разный шаблон нагрузки

source: Depended must have same or bigger forecast step, got {} -> {}
ru: Зависимая операция должна иметь одинаковый или больший шаг прогноза, имеется {} -> {}

source: Error in formula: {formula}.
ru: Ошибка в формуле: {formula}

source: aggregation date and time
ru: дата и время агрегации

source: report (data file) date
ru: дата отчёта (файла с данными)

source: Name with code {code} already exists.
ru: Название с кодом {code} уже существует.

source: The name {name} is already in the system
ru: Название {name} уже есть в системе

source: This operation type depends on operations with less forecast steps.
ru: Этот тип операции зависит от операций с меньшим шагом прогноза.

source: This operation type is dependency of operations with bigger forecast steps.
ru: От этого типа операций зависят операции с большим шагом прогноза.

source: You cant set constant value because this operation has depndences.
ru: Вы не можете указать постоянное значение, так как у данной операции есть зависимости.

source: There is no such work type or it is not associated with the operation type {work_type}.
ru: Нет такого типа работ или он не связан с типом операций {work_type}

source: There is no such operation type {operation_type}.
ru: Нет такого типа операций {operation_type}.

source: Files with this extension are not supported.
ru: Файлы с таким расширением не поддерживается.

source: Shop id should be defined
ru: ID магазина обязательно

source: Failed to open active sheet.
ru: Не удалось открыть активный лист.

source: Please select a period of no more than 90 days.
ru: Выберите, пожалуйста, период не больше 90 дней.

source: Date start should be less then date end
ru: Дата начала должна быть меньше чем дата окончания.

source: Settings for data processing not found.
ru: Не найдены настройки для обработки данных

source: Data with unique fields already exists.
ru: Данные с уникальными полями уже существуют

source: There is no department with this identifier: {key}.
ru: Нет департамента с таким идентификатором: {key}.

source: You must select either a user or a group
ru: Вы должны выбрать пользователя или группу

source: You cannot select both a user and a group at the same time
ru: Вы не можете выбрать пользователя и группу одновременно

source: There are no reports available.
ru: Нет доступных отчётов

source: No faces found on the image.
ru: На фото не было найдено лицо.

source: Recognition service is temporarily unavailable. Please contact your system administrator.
ru: Сервис распознавания временно недоступен. Пожалуйста, обратитесь к администратору системы.

source: Coming
ru: Приход

source: Leaving
ru: Уход

source: Break start
ru: Начало перерыва

source: Break end
ru: Конец перерыва

source: No type
ru: Нет типа

source: Key
ru: Ключ

source: Created
ru: Создан

source: Shop in tick point must be equal to shop in this record.
ru: Магазин в точке отметки должен совпадать с магазином в записи.

source: Must include "username" and "password".
ru: Должен включать "username" и "password".

source: The distance to the department should not exceed {allowed_distance_km} km ({distance_now_km} km now)
ru: Дистанция до магазина не должна превышать {allowed_distance_km} км (сейчас {distance_now_km} км)

source: A session is already open for this tick point
ru: Для этой точки уже открыта сессия

source: You do not have an active employment at the moment, the action can not be performed, please refer to your management
ru: У вас нет трудоустройства на текущий момент, действие выполнить невозможно, пожалуйста, обратитесь к вашему руководству

source: Today, the employee does not have a working day in this shop
ru: Сегодня у сотрудника нет рабочего дня в данном магазине

source: The tick does not exist
ru: Отметка не существует

source: Today
ru: Сегодня

source: Yesterday
ru: Вчера

source: End of previous month
ru: Конец предыдущего месяца

source: End of previous quarter
ru: Конец предыдущего квартала

source: End of previous half a year
ru: Конец предыдущей половины года

source: End of previous year
ru: Конец предыдущего года

source: Time period must be within one month.
ru: Период должен быть в рамках одного месяца.

source: Tick report
ru: Отчет по отметкам сотрудников

source: There has been an error generating your report. Please contact the technical support.
ru: Произошла ошибка при формировании Вашего отчёта. Пожалуйста, обратитесь в техническую поддержку.

source: Tick date and time
ru: Дата и время отметки

source: Full name
ru: ФИО

source: Employee id
ru: Табельный номер

source: The norm for the accounting period
ru: Норма за учетный период

source: Worked out for today ({})
ru: Отработано на сегодня ({})

source: Total overtimes/undertimes ({})
ru: Всего переработки/недоработки ({})

source: The norm of hours
ru: Норма часов

source: Hours worked
ru: Отработано часов

source: Total overtimes/undertimes
ru: Всего переработки/недоработки

source: Overtimes/undertimes in celebrations
ru: Переработки/недоработки: отработано часов в праздники

source: Planned work hours
ru: Плановое количество часов

source: Employee network
ru: Сеть сотрудника

source: Department
ru: Подразделение

source: Work type
ru: Тип работ

source: Tabel code
ru: Табельный номер

source: Hours in period
ru: Часов за период

source: TOTAL
ru: ОБЩИЙ ИТОГ

source: Tabel
ru: Табель

source: Pivot tabel
ru: Сводный табель

source: Home
ru: Начало

source: History
ru: История

source: View on site
ru: Посмотреть на сайте

source: Not approved plan
ru: План черновик

source: Approved plan
ru: План подтвержденный

source: Approved fact
ru: Факт подтвержденный

source: Not approved fact
ru: Факт черновик

source: Last name
ru: Фамилия

source: First name
ru: Имя

source: Username
ru: Логин

source: Department name
ru: Наименование подразделения

source: Department code
ru: Код подразделения

source: Record type
ru: Тип отметки

source: Date and time of the record
ru: Дата и время отметки

source: Records
ru: Отметки

source: Timetable should be built at least from {num} day from now.
ru: Расписание можно строить не раньше чем через {num} дня от текущего

source: Timetable already exists.
ru: Расписание уже существует

source: No work type set for users: {users}.
ru: Не проставлены типы работ у пользователей: {users}.

source: Not enough demand {period} for work type {work_type}.
ru: На типе работ {work_type} не хватает объектов спроса {period}.

source: More than one shift are selected for worker {id} {last_name} {first_name} with fixed hours.
ru: Ошибка! Работник {id} {last_name} {first_name} с фиксированными часами, но на один день выбрано больше одной смены!

source: Fail sending data to server.
ru: Ошибка отправки данных на сервер.

source: You can't delete timetable in the past.
ru: Вы не можете удалить расписание в прошлом.

source: You need to select auto-scheduling settings for the department.
ru: Необходимо выбрать шаблон смен.

source: You need to select an interval within a single accounting period.
ru: Небходимо выбрать интервал в рамках одного учетного периода.

source: The operation cannot be performed. Unacceptable intersection of working hours. ({overlaps_str})
ru: Операция не может быть выполнена. Недопустимое пересечение времени работы. ({overlaps_str})

source: The operation cannot be performed. Restrictions on scheduled tasks have been violated. ({task_violation_str})
ru: Операция не может быть выполнена. Нарушены ограничения по запланированным задачам. ({task_violation_str})

source: The operation cannot be performed. The restrictions on the allowed types of days on one date for one employee have been violated. ({error_str})
ru: Операция не может быть выполнена. Нарушены ограничения по разрешенным типам дней на одну дату для одного сотрудника. ({error_str})

source: The operation cannot be performed. Creating multiple days on the same date for one employee is prohibited. ({error_str})
ru: Операция не может быть выполнена. Создание нескольких дней на одну дату для одного сотрудника запрещено. ({error_str})

source: The operation cannot be performed. The restrictions on the number of hours in the main schedule have been violated. ({error_str})
ru: Операция не может быть выполнена. Нарушены ограничения по количеству часов в основном графике. ({error_str})

source: Hours calculation based on average monthly value of the recommended norm
ru: Расчет часов на основе среднемесячного значения рекомендуемой нормы

source: Hours calculation based on production calendar norm
ru: Расчет часов на основе нормы по производственному календарю

source: Manual setting of hours
ru: Ручное проставление часов

source: Manual setting of hours or average monthly value of the recommended norm
ru: Ручное проставление часов или среднемесячное значение рекомендуемой нормы

source: Maximum number of hours for one date for employee
ru: Максимальное количество часов на одну дату у сотрудника

source: Norm settings are not configured (through position or employment)
ru: Настройки нормы не установлены (через должность или трудоустройство)

source: Can't create a working day in the schedule, since the user is not employed during this period
ru: Невозможно создать рабочий день, так как пользователь в этот период не трудоустроен

source: Fact
ru: Факт

source: Main
ru: Осн

source: Additional
ru: Доп

source: Planned timetable
ru: Планируемый график

source: Actual timetable
ru: Фактический график

source: Manual changes
ru: Ручные изменения

source: Determined by the system
ru: Определено системой

source: You have no active employment
ru: У вас нет активного трудоустройства

source: Automatic create vacancies
ru: Автоматически создавать вакансии

source: Automatic delete vacancies
ru: Автоматически удалять вакансии

source: Automatic check lack timegap
ru: Период, за который проверяем

source: Automatic holiday worker select timegap
ru: С какого дня выводить с выходного

source: Automatic exchange
ru: Включить автоматическую биржу смен

source: Max working hours
ru: Максимальное количество рабочих часов в месяц для вывода с выходного

source: Constraints
ru: Ограничения

source: Exclude positions
ru: Должности которые не участвуют в обмене сменами

source: Automatic create vacancy lack min
ru: Минимальная потребность в сотруднике при создании вакансии

source: Automatic delete vacancy lack max
ru: Максимальная потребность в сотруднике для удалении вакансии
